
#Область ФункцииОбщегоНазначения

Функция ДобавитьЗаголовки(Результат)
	
	Результат.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	Результат.Заголовки.Вставить("Access-Control-Allow-Methods", "*");
	Результат.Заголовки.Вставить("Access-Control-Allow-Headers", "Origin, X-Requested-With, Content-Type, Accept, Authorization");
	Возврат Результат;  
	
КонецФункции

//Функция возвращает ответ от HTTP сервиса в формате JSON
Функция СформироватьОтветДляHTTPСервиса(Статус, ТекстовоеСообщение)
	
	СтрокаДляОтвета = ОбработкаJSON.ЗаписатьJSON_Обработка(ТекстовоеСообщение);
		   
	Ответ = Новый HTTPСервисОтвет(Статус);
    Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат ДобавитьЗаголовки(Ответ)
	
КонецФункции

Функция ПрочитатьJSONИзСтроки(СтрокаJSON)  
	
	ЧтениеJSON = Новый ЧтениеJSON;	
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);	
	Структура = ПрочитатьJSON(ЧтениеJSON, Ложь);		
	ЧтениеJSON.Закрыть();
	
	Возврат Структура;
		
КонецФункции

Функция ПолучитьЕдиницуИзмеренияПоНаименованию(Номенклатура, НаименованиеЕдИзм)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕдиницыИзмерения.Ссылка
	               |ИЗ
	               |	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	               |ГДЕ
	               |	ЕдиницыИзмерения.Владелец = &Владелец
	               |	И ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Наименование = &Наименование
	               |	И НЕ ЕдиницыИзмерения.ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование", НаименованиеЕдИзм);
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
		
КонецФункции

Функция СоздатьНоменклатуру(Пользователь, Наименование, НаименованиеЕдИзм, Артикул)  
	
	БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(НаименованиеЕдИзм);
	Если БазоваяЕдиницаИзмерения.Пустая() Тогда
		БазоваяЕдиницаИзмерения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнаяЕдиницаПоКлассификатору");
	КонецЕсли;
	Если БазоваяЕдиницаИзмерения.Пустая() Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	НоменклатураОб = Справочники.Номенклатура.СоздатьЭлемент();
	НоменклатураОб.Наименование = Наименование;
	НоменклатураОб.НаименованиеПолное = Наименование;
	НоменклатураОб.Артикул = Артикул;
	НоменклатураОб.БазоваяЕдиницаИзмерения = БазоваяЕдиницаИзмерения;
	НоменклатураОб.ВидНоменклатуры = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнойВидНоменклатуры");	
	НоменклатураОб.СтавкаНДС = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнаяСтавкаНДС");	
	НоменклатураОб.Записать();
	
	ЕдиницаОбъект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
	ЕдиницаОбъект.Наименование            = СокрЛП(БазоваяЕдиницаИзмерения);
	ЕдиницаОбъект.ЕдиницаПоКлассификатору = БазоваяЕдиницаИзмерения;
	ЕдиницаОбъект.Коэффициент             = 1;
	ЕдиницаОбъект.Владелец                = НоменклатураОб.Ссылка;
	ЕдиницаОбъект.Записать();
	
	НоменклатураОб.ЕдиницаДляОтчетов = ЕдиницаОбъект.Ссылка;
	НоменклатураОб.ЕдиницаИзмеренияМест = ЕдиницаОбъект.Ссылка;
	НоменклатураОб.ЕдиницаХраненияОстатков = ЕдиницаОбъект.Ссылка;
	НоменклатураОб.Записать();
	
	Возврат НоменклатураОб.Ссылка;
		
КонецФункции

Функция ПолучитьДоговорПоВалюте(Организация, Контрагент, Валюта)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Владелец = &Контрагент
	               |	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &Валюта
	               |	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	               |	И ДоговорыКонтрагентов.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
		
КонецФункции

Процедура Документы_ИзменитьДанныеПриходнаяНакладная(Данные, Пользователь, ДанныеРезультат)
		
	Если Данные.Свойство("id") И ЗначениеЗаполнено(Данные.id) Тогда
		Документ = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.id));
		ДокументОбъект = Документ.ПолучитьОбъект();
		Если ДокументОбъект = Неопределено Тогда
			ДанныеРезультат.Вставить("status", "ERROR");
			ДанныеРезультат.Вставить("msg", "Document not found!");			
			Возврат;
		КонецЕсли;	
	Иначе
		ДокументОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
	КонецЕсли;
	
	мВалютаРегламентированногоУчета   = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	ДокументОбъект.Заполнить(Неопределено);
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	Попытка
	ДокументОбъект.Дата = Дата(Данные.invoice_date);
	Исключение
		// "01.07.2025"
		Попытка
		ДокументОбъект.Дата = Дата(Прав(Данные.invoice_date,4)+ Сред(Данные.invoice_date,4,2) + Лев(Данные.invoice_date,2));
		Исключение
		КонецПопытки;
	КонецПопытки;
	
	Если Данные.Свойство("customer") И Данные.customer.Свойство("id") И ЗначениеЗаполнено(Данные.customer.id) Тогда
		Попытка
		ДокументОбъект.Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.customer.id));
		Исключение
		КонецПопытки
	КонецЕсли;
	Если ДокументОбъект.Организация.Пустая() Тогда
		ДокументОбъект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнаяОрганизация");
	КонецЕсли;
	ДокументОбъект.Ответственный = Пользователь;
	ДокументОбъект.ОтражатьВБухгалтерскомУчете = Истина;
	ДокументОбъект.ОтражатьВУправленческомУчете = Истина;
	ДокументОбъект.УчитыватьНДС = Истина;
	ДокументОбъект.НомерВходящегоДокумента = Данные.invoice_number;
	ДокументОбъект.ДатаВходящегоДокумента = ДокументОбъект.Дата;

	ДокументОбъект.Комментарий = "Імпортовано через сервіс OpenBP, документ №" + Данные.invoice_number + " від " + Данные.invoice_date;
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
	ДокументОбъект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
	Попытка
		ДокументОбъект.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.supplier.id));
	Исключение
	КонецПопытки;
	Если ДокументОбъект.Контрагент.Пустая() Тогда
		ДокументОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", Данные.supplier.tin);	
	КонецЕсли;	
		
	ДокументОбъект.ВалютаДокумента = мВалютаРегламентированногоУчета;
	Если ДокументОбъект.Контрагент.ОсновнойДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		ДокументОбъект.ДоговорКонтрагента = ДокументОбъект.Контрагент.ОсновнойДоговорКонтрагента;	
	Иначе	
		ДокументОбъект.ДоговорКонтрагента = ПолучитьДоговорПоВалюте(ДокументОбъект.Организация, ДокументОбъект.Контрагент, ДокументОбъект.ВалютаДокумента);
	КонецЕсли;
	
	ДокументОбъект.ТипЦен = ДокументОбъект.ДоговорКонтрагента.ТипЦен;
	Попытка
		ДокументОбъект.СуммаВключаетНДС = Булево(Данные.inсlude_vat);
	Исключение
		ДокументОбъект.СуммаВключаетНДС = ДокументОбъект.ТипЦен.ЦенаВключаетНДС;	
	КонецПопытки;	
	ДокументОбъект.БанковскийСчетКонтрагента = ДокументОбъект.Контрагент.ОсновнойБанковскийСчет;
	
	СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ДокументОбъект);
	ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(ДокументОбъект, ДокументОбъект.ВалютаДокумента, мВалютаРегламентированногоУчета, Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов, СтруктураРеквизитовДокумента, "Покупка", "Товары");
		
	Если Данные.Свойство("warehouse") И Данные.warehouse.Свойство("id") И ЗначениеЗаполнено(Данные.warehouse.id) Тогда
		ДокументОбъект.СкладОрдер = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.warehouse.id));
	Иначе
		ДокументОбъект.СкладОрдер = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнойСклад");
	КонецЕсли;
	
	СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(ДокументОбъект.Организация, ДокументОбъект.Контрагент, ДокументОбъект.ДоговорКонтрагента);
	
	Если ДокументОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		ДокументОбъект.СчетУчетаРасчетовСКонтрагентом 		= СчетаУчета.СчетРасчетов;
	Иначе
		ДокументОбъект.СчетУчетаРасчетовСКонтрагентом 		= СчетаУчета.СчетРасчетов;
		ДокументОбъект.СчетУчетаРасчетовПоАвансам    		= СчетаУчета.СчетАвансов;
		Если ДокументОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
			ДокументОбъект.СчетУчетаРасчетовСКонтрагентом 	= СчетаУчета.СчетРасчетовПриБартере;
			ДокументОбъект.СчетУчетаРасчетовПоАвансам     	= СчетаУчета.СчетАвансовПриБартере;
		КонецЕсли;	
		ДокументОбъект.СчетУчетаРасчетовПоТаре       		= СчетаУчета.СчетУчетаТары;
		ДокументОбъект.СчетУчетаРасчетовПоТареПоАвансам 	= СчетаУчета.СчетАвансовПоТаре;			
	КонецЕсли;
	ДокументОбъект.СчетУчетаНДС 							= СчетаУчета.СчетУчетаНДСПриобретений;
	ДокументОбъект.СчетУчетаНДСПодтвержденный  				= СчетаУчета.СчетУчетаНДСПриобретенийПодтвержденный;
	
	Если ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента.ОсновнойПроект) Тогда
		ДокументОбъект.Проект = ДокументОбъект.ДоговорКонтрагента.ОсновнойПроект;
	КонецЕсли;
	
	ДокументОбъект.Товары.Очистить();
	
	Для Каждого СтрокаЗапасы Из Данные.items Цикл
		
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		
		Если ЗначениеЗаполнено(СтрокаЗапасы.item_code) Тогда
			СтрокаТабличнойЧасти.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаЗапасы.item_code);
		КонецЕсли;
		Если СтрокаТабличнойЧасти.Номенклатура.Пустая() Тогда
			СтрокаТабличнойЧасти.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(СтрокаЗапасы.description, Истина);
		КонецЕсли;
		Если СтрокаТабличнойЧасти.Номенклатура.Пустая() Тогда
			СтрокаТабличнойЧасти.Номенклатура = СоздатьНоменклатуру(Пользователь, СтрокаЗапасы.description, СтрокаЗапасы.unit, СтрокаЗапасы.item_code);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтрокаЗапасы.unit) Тогда
			СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьЕдиницуИзмеренияПоНаименованию(СтрокаТабличнойЧасти.Номенклатура, СтрокаЗапасы.unit);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) Тогда
			СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Склад = ДокументОбъект.СкладОрдер;
		
		СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(ДокументОбъект.Организация, СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Склад);
		СтрокаТабличнойЧасти.СчетУчетаБУ 			= СчетаУчета.СчетУчетаБУ;
		СтрокаТабличнойЧасти.НалоговоеНазначение 	= СчетаУчета.НалоговоеНазначение;
		
		Если СтрокаЗапасы.Свойство("rate_VAT_id") И ЗначениеЗаполнено(СтрокаЗапасы.rate_VAT_id) Тогда
			знПеречисления = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления.Найти(СтрокаЗапасы.rate_VAT_id);
			Если знПеречисления <> Неопределено Тогда
				СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС[знПеречисления.Имя];
			КонецЕсли;			
		КонецЕсли;
		Если СтрокаТабличнойЧасти.СтавкаНДС.Пустая() Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Количество = СтрокаЗапасы.quantity;
		СтрокаТабличнойЧасти.Коэффициент = 1;
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		
		СтрокаТабличнойЧасти.Цена 		= СтрокаЗапасы.price;
		СтрокаТабличнойЧасти.Сумма 		= СтрокаЗапасы.total_price;
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		
	КонецЦикла;	
	
	Попытка 
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ДанныеРезультат.Вставить("status", "OK");
		ДанныеРезультат.Вставить("msg", "");			
	Исключение
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		ДанныеРезультат.Вставить("status", "ERROR");
		ДанныеРезультат.Вставить("msg", "Document posting error!");			
	КонецПопытки;	
	
	ДанныеРезультат.Вставить("id", Строка(ДокументОбъект.Ссылка.УникальныйИдентификатор()));			
	ДанныеРезультат.Вставить("number", ДокументОбъект.Номер);			

КонецПроцедуры

Процедура Документы_ИзменитьДанныеЗаказПоставщику(Данные, Пользователь, ДанныеРезультат)
		
	Если Данные.Свойство("id") И ЗначениеЗаполнено(Данные.id) Тогда
		Документ = Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.id));
		ДокументОбъект = Документ.ПолучитьОбъект();
		Если ДокументОбъект = Неопределено Тогда
			ДанныеРезультат.Вставить("status", "ERROR");
			ДанныеРезультат.Вставить("msg", "Document not found!");			
			Возврат;
		КонецЕсли;	
	Иначе
		ДокументОбъект = Документы.ЗаказПоставщику.СоздатьДокумент();
	КонецЕсли;
	
	мВалютаРегламентированногоУчета   = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	ДокументОбъект.Заполнить(Неопределено);
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	Попытка
	ДокументОбъект.Дата = Дата(Данные.invoice_date);
	Исключение
		// "01.07.2025"
		Попытка
		ДокументОбъект.Дата = Дата(Прав(Данные.invoice_date,4)+ Сред(Данные.invoice_date,4,2) + Лев(Данные.invoice_date,2));
		Исключение
		КонецПопытки;
	КонецПопытки;
	
	Если Данные.Свойство("customer") И Данные.customer.Свойство("id") И ЗначениеЗаполнено(Данные.customer.id) Тогда
		Попытка
		ДокументОбъект.Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.customer.id));
		Исключение
		КонецПопытки
	КонецЕсли;
	Если ДокументОбъект.Организация.Пустая() Тогда
		ДокументОбъект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнаяОрганизация");
	КонецЕсли;
	ДокументОбъект.Ответственный = Пользователь;
	ДокументОбъект.УчитыватьНДС = Истина;
	ДокументОбъект.ДатаПоступления = ДокументОбъект.Дата;

	ДокументОбъект.Комментарий = "Імпортовано через сервіс OpenBP, документ №" + Данные.invoice_number + " від " + Данные.invoice_date;
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийЗаказПоставщику.ПокупкаКомиссия;
	Попытка
		ДокументОбъект.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.supplier.id));
	Исключение
	КонецПопытки;
	Если ДокументОбъект.Контрагент.Пустая() Тогда
		ДокументОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", Данные.supplier.tin);	
	КонецЕсли;	
		
	ДокументОбъект.ВалютаДокумента = мВалютаРегламентированногоУчета;
	Если ДокументОбъект.Контрагент.ОсновнойДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		ДокументОбъект.ДоговорКонтрагента = ДокументОбъект.Контрагент.ОсновнойДоговорКонтрагента;	
	Иначе	
		ДокументОбъект.ДоговорКонтрагента = ПолучитьДоговорПоВалюте(ДокументОбъект.Организация, ДокументОбъект.Контрагент, ДокументОбъект.ВалютаДокумента);
	КонецЕсли;
	
	ДокументОбъект.ТипЦен = ДокументОбъект.ДоговорКонтрагента.ТипЦен;
	Попытка
		ДокументОбъект.СуммаВключаетНДС = Булево(Данные.inсlude_vat);
	Исключение
		ДокументОбъект.СуммаВключаетНДС = ДокументОбъект.ТипЦен.ЦенаВключаетНДС;	
	КонецПопытки;	
	
	СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ДокументОбъект);
	ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(ДокументОбъект, ДокументОбъект.ВалютаДокумента, мВалютаРегламентированногоУчета, Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов, СтруктураРеквизитовДокумента, "Покупка", "Товары");
		
	Если Данные.Свойство("warehouse") И Данные.warehouse.Свойство("id") И ЗначениеЗаполнено(Данные.warehouse.id) Тогда
		ДокументОбъект.Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.warehouse.id));
	Иначе
		ДокументОбъект.Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователь, "ОсновнойСклад");
	КонецЕсли;
			
	ДокументОбъект.Товары.Очистить();
	
	Для Каждого СтрокаЗапасы Из Данные.items Цикл
		
		СтрокаТабличнойЧасти = ДокументОбъект.Товары.Добавить();
		
		Если ЗначениеЗаполнено(СтрокаЗапасы.item_code) Тогда
			СтрокаТабличнойЧасти.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаЗапасы.item_code);
		КонецЕсли;
		Если СтрокаТабличнойЧасти.Номенклатура.Пустая() Тогда
			СтрокаТабличнойЧасти.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(СтрокаЗапасы.description, Истина);
		КонецЕсли;	
		Если СтрокаТабличнойЧасти.Номенклатура.Пустая() Тогда
			СтрокаТабличнойЧасти.Номенклатура = СоздатьНоменклатуру(Пользователь, СтрокаЗапасы.description, СтрокаЗапасы.unit, СтрокаЗапасы.item_code);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтрокаЗапасы.unit) Тогда
			СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьЕдиницуИзмеренияПоНаименованию(СтрокаТабличнойЧасти.Номенклатура, СтрокаЗапасы.unit);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) Тогда
			СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков;
		КонецЕсли;
		
		Если СтрокаЗапасы.Свойство("rate_VAT_id") И ЗначениеЗаполнено(СтрокаЗапасы.rate_VAT_id) Тогда
			знПеречисления = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления.Найти(СтрокаЗапасы.rate_VAT_id);
			Если знПеречисления <> Неопределено Тогда
				СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС[знПеречисления.Имя];
			КонецЕсли;			
		КонецЕсли;
		Если СтрокаТабличнойЧасти.СтавкаНДС.Пустая() Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Количество = СтрокаЗапасы.quantity;
		СтрокаТабличнойЧасти.Коэффициент = 1;
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		
		СтрокаТабличнойЧасти.Цена 		= СтрокаЗапасы.price;
		СтрокаТабличнойЧасти.Сумма 		= СтрокаЗапасы.total_price;
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		
	КонецЦикла;	
	
	Попытка 
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ДанныеРезультат.Вставить("status", "OK");
		ДанныеРезультат.Вставить("msg", "");			
	Исключение
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		ДанныеРезультат.Вставить("status", "ERROR");
		ДанныеРезультат.Вставить("msg", "Document posting error!");			
	КонецПопытки;	
	
	ДанныеРезультат.Вставить("id", Строка(ДокументОбъект.Ссылка.УникальныйИдентификатор()));			
	ДанныеРезультат.Вставить("number", ДокументОбъект.Номер);			

КонецПроцедуры

Функция Справочники_ПолучитьДанныеКонтрагенты(Контрагенты = Неопределено)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	сСправочник.Ссылка КАК Ссылка,
	               |	сСправочник.Наименование КАК Наименование,
	               |	сСправочник.НаименованиеПолное КАК НаименованиеПолное,
	               |	сСправочник.ИНН КАК ИНН,
	               |	ВЫБОР
	               |		КОГДА сСправочник.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА ""Юрособа""
	               |		ИНАЧЕ ""Фізособа""
	               |	КОНЕЦ КАК ЮрФизЛицо,
	               |	ЕСТЬNULL(КИ_Телефон.Представление, """") КАК Телефон,
	               |	ЕСТЬNULL(КИ_ЭлПочта.Представление, """") КАК Почта,
	               |	ЕСТЬNULL(КИ_Адрес.Представление, """") КАК ПредставлениеАдреса,
	               |	ЕСТЬNULL(КИ_Адрес.Поле1, """") КАК Индекс,
	               |	ЕСТЬNULL(КИ_Адрес.Поле2, """") КАК Страна,
	               |	ЕСТЬNULL(КИ_Адрес.Поле3, """") КАК Район,
	               |	ЕСТЬNULL(КИ_Адрес.Поле4, """") КАК Город,
	               |	ЕСТЬNULL(КИ_Адрес.Поле6, """") КАК Улица,
	               |	ЕСТЬNULL(КИ_Адрес.Поле7, """") КАК Дом,
	               |	ЕСТЬNULL(КИ_Адрес.Поле9, """") КАК Квартира
	               |ИЗ
	               |	Справочник.Контрагенты КАК сСправочник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КИ_Телефон
	               |		ПО (КИ_Телефон.Объект = сСправочник.Ссылка)
	               |			И (КИ_Телефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КИ_ЭлПочта
	               |		ПО (КИ_ЭлПочта.Объект = сСправочник.Ссылка)
	               |			И (КИ_ЭлПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КИ_Адрес
	               |		ПО (КИ_Адрес.Объект = сСправочник.Ссылка)
	               |			И (КИ_Адрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	               |ГДЕ
	               |	НЕ сСправочник.ПометкаУдаления
	               |	И НЕ сСправочник.ЭтоГруппа
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоКонтрагентах
	               |				ТОГДА сСправочник.Ссылка В (&Контрагенты)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.УстановитьПараметр("ОтборПоКонтрагентах", Не Контрагенты = Неопределено);	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДЗ = РезультатЗапроса.Выбрать();
	
	МассивДанные = Новый Массив;
	
	Пока ВыборкаДЗ.Следующий() Цикл
		
		СтруктураАдрес = Новый Структура("country, voivodeship, district, commune, city, index, street, house, flat", 
											"", "", "", "", "", "", "", "", "");
		СтруктураАдрес.index = ВыборкаДЗ.Индекс;
		СтруктураАдрес.country = ВыборкаДЗ.Страна;
		СтруктураАдрес.voivodeship = "";
		СтруктураАдрес.district = ВыборкаДЗ.Район;
		СтруктураАдрес.commune = ВыборкаДЗ.Город;
		СтруктураАдрес.city = "";
		СтруктураАдрес.street = ВыборкаДЗ.Улица;
		СтруктураАдрес.house = ВыборкаДЗ.Дом;
		СтруктураАдрес.flat = ВыборкаДЗ.Квартира;
									
		СтруктураДанные = Новый Структура;

		СтруктураДанные.Вставить("id", ВыборкаДЗ.Ссылка);
		СтруктураДанные.Вставить("name", ВыборкаДЗ.Наименование);
		СтруктураДанные.Вставить("fullName", ВыборкаДЗ.НаименованиеПолное);
		СтруктураДанные.Вставить("tin", ВыборкаДЗ.ИНН);
		СтруктураДанные.Вставить("legalPhysics", ВыборкаДЗ.ЮрФизЛицо);
		СтруктураДанные.Вставить("country", "");
		СтруктураДанные.Вставить("telephone", ВыборкаДЗ.Телефон);
		СтруктураДанные.Вставить("mail", ВыборкаДЗ.Почта);
		СтруктураДанные.Вставить("address_string", ВыборкаДЗ.ПредставлениеАдреса);
		СтруктураДанные.Вставить("address", СтруктураАдрес);
			
		МассивДанные.Добавить(СтруктураДанные);
		
	КонецЦикла;	
	
	Возврат МассивДанные;
	
КонецФункции

Функция Справочники_ПолучитьДанныеКонтрагентыИерархия(Контрагенты = Неопределено)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	сСправочник.Ссылка КАК Ссылка,
	               |	сСправочник.Наименование КАК Наименование,
	               |	сСправочник.Родитель
	               |ИЗ
	               |	Справочник.Контрагенты КАК сСправочник
	               |ГДЕ
	               |	сСправочник.ЭтоГруппа
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоКонтрагентах
	               |				ТОГДА сСправочник.Ссылка В (&Контрагенты)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.УстановитьПараметр("ОтборПоКонтрагентах", Не Контрагенты = Неопределено);	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДЗ = РезультатЗапроса.Выбрать();
	
	МассивДанные = Новый Массив;
	
	Пока ВыборкаДЗ.Следующий() Цикл
											
		СтруктураДанные = Новый Структура;

		СтруктураДанные.Вставить("id", ВыборкаДЗ.Ссылка);
		СтруктураДанные.Вставить("name", ВыборкаДЗ.Наименование);
		СтруктураДанные.Вставить("parent_id", ВыборкаДЗ.Родитель);
			
		МассивДанные.Добавить(СтруктураДанные);
		
	КонецЦикла;	
	
	Возврат МассивДанные;
	
КонецФункции

Функция Справочники_ПолучитьДанныеНоменклатура(Номенклатура = Неопределено)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОбороты.Номенклатура,
	               |	СУММА(ТоварыНаСкладахОбороты.КоличествоПриход) КАК КоличествоПриход
	               |ПОМЕСТИТЬ ВТ_Фильтр
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Обороты КАК ТоварыНаСкладахОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыНаСкладахОбороты.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	сСправочник.Ссылка КАК Ссылка,
	               |	сСправочник.Наименование КАК Наименование,
	               |	сСправочник.НаименованиеПолное КАК НаименованиеПолное,
	               |	сСправочник.Артикул КАК Артикул,
	               |	сСправочник.ВидНоменклатуры.ТипНоменклатуры КАК ТипНоменклатуры,
	               |	сСправочник.СтавкаНДС КАК СтавкаНДС,
	               |	сСправочник.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	ВТ_Фильтр КАК ВТ_Фильтр
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК сСправочник
	               |		ПО ВТ_Фильтр.Номенклатура = сСправочник.Ссылка
	               |ГДЕ
	               |	НЕ сСправочник.ПометкаУдаления
	               |	И НЕ сСправочник.ЭтоГруппа
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоНоменклатуре
	               |				ТОГДА сСправочник.Ссылка В (&Номенклатура)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ОтборПоНоменклатуре", Не Номенклатура = Неопределено);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДЗ = РезультатЗапроса.Выбрать();
	
	МассивДанные = Новый Массив;
	
	Пока ВыборкаДЗ.Следующий() Цикл
		
		Если ВыборкаДЗ.ТипНоменклатуры.Пустая() Тогда
			ТипНоменклатуры = "";	
		Иначе
			ИндексТипНоменклатуры = Перечисления.ТипыНоменклатуры.Индекс(ВыборкаДЗ.ТипНоменклатуры);
			ТипНоменклатуры = Метаданные.Перечисления.ТипыНоменклатуры.ЗначенияПеречисления[ИндексТипНоменклатуры].Имя;
		КонецЕсли;
		
		Если ВыборкаДЗ.СтавкаНДС.Пустая() Тогда
			СтавкаНДС = "";	
		Иначе
			ИндексСтавкиНДС = Перечисления.СтавкиНДС.Индекс(ВыборкаДЗ.СтавкаНДС);
			СтавкаНДС = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления[ИндексСтавкиНДС].Имя;
		КонецЕсли;		
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("id", Строка(ВыборкаДЗ.Ссылка.УникальныйИдентификатор()));
		СтруктураДанные.Вставить("name", ВыборкаДЗ.Наименование);
		СтруктураДанные.Вставить("fullName", ВыборкаДЗ.НаименованиеПолное);
		СтруктураДанные.Вставить("internationalName", "");			
		СтруктураДанные.Вставить("article", ВыборкаДЗ.Артикул);
		СтруктураДанные.Вставить("type", ТипНоменклатуры);						
		СтруктураДанные.Вставить("barcode", "");
		СтруктураДанные.Вставить("rate_VAT_id", СтавкаНДС);
		СтруктураДанные.Вставить("unitId", Строка(ВыборкаДЗ.ЕдиницаИзмерения.УникальныйИдентификатор()));
		
		МассивДанные.Добавить(СтруктураДанные);
		
	КонецЦикла;	
	
	Возврат МассивДанные;
	
КонецФункции

Функция Справочники_ПолучитьДанныеНоменклатураИерархия(Номенклатура = Неопределено)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	сСправочник.Ссылка КАК Ссылка,
	               |	сСправочник.Наименование КАК Наименование,
	               |	сСправочник.Родитель КАК Родитель
	               |ИЗ
	               |	Справочник.Номенклатура КАК сСправочник
	               |ГДЕ
	               |	сСправочник.ЭтоГруппа
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоНоменклатуре
	               |				ТОГДА сСправочник.Ссылка В (&Номенклатура)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ОтборПоНоменклатуре", Не Номенклатура = Неопределено);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДЗ = РезультатЗапроса.Выбрать();
	
	МассивДанные = Новый Массив;
	
	Пока ВыборкаДЗ.Следующий() Цикл
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("id", ВыборкаДЗ.Ссылка);
		СтруктураДанные.Вставить("name", ВыборкаДЗ.Наименование);
		СтруктураДанные.Вставить("parent_id", ВыборкаДЗ.Родитель);
		
		МассивДанные.Добавить(СтруктураДанные);
		
	КонецЦикла;	
	
	Возврат МассивДанные;
	
КонецФункции

#КонецОбласти

#Область Отчеты

Функция reportsCSVПолучитьДанные(Запрос)

	Перем Ответ;

	dateStart = Запрос.ПараметрыЗапроса.Получить("dateStart");
	dateEnd = Запрос.ПараметрыЗапроса.Получить("dateEnd");
	ТипОтчета = Запрос.ПараметрыЗапроса.Получить("type");
	ОрганизаияКод = Запрос.ПараметрыЗапроса.Получить("organization");

	УстановитьПривилегированныйРежим(Истина);

	Попытка

		Если dateEnd = Неопределено Тогда
			Возврат СформироватьОтветДляHTTPСервиса(404, "date isn't provided");	
		КонецЕсли;

		СтрокаДляОтвета = "";

		НачалоПериода = НачалоДня(?(dateStart = Неопределено,Дата(1,1,1),Дата(dateStart)));
		КонецПериода = КонецДня(Дата(dateEnd));

		Если ТипОтчета = "Saldo" Тогда
			ОрганизаияUUID = Новый УникальныйИдентификатор(ОрганизаияКод);
			ОрганизацияСсылка = Справочники.Организации.ПолучитьСсылку(ОрганизаияUUID);
			Если ОрганизацияСсылка.ПолучитьОбъект() = Неопределено Тогда
				СформироватьОтветДляHTTPСервиса("404", "Організація не знайдена");
			КонецЕсли;
			СтрокаДляОтвета = СформироватьОтчетПоСальдо(НачалоПериода, КонецПериода, ОрганизацияСсылка);
		ИначеЕсли ТипОтчета = "PaymentTerms" Тогда
			СтрокаДляОтвета = СформироватьОтчетПоСтруктуреДебиторскойЗадолжености(КонецПериода);
		ИначеЕсли ТипОтчета = "CounterpartiesSettlements" Тогда
			СтрокаДляОтвета = СформироватьОтчетПоВзаиморасчетамСПокупателями(НачалоПериода, КонецПериода);
		ИначеЕсли ТипОтчета = "SuppliersSettlements" Тогда
			СтрокаДляОтвета = СформироватьОтчетПоВзаиморасчетамСПоставщиками(НачалоПериода, КонецПериода);
		ИначеЕсли ТипОтчета = "InventoryBalance" Тогда
			СтрокаДляОтвета = СформироватьОтчетПоЗапасамОстатки(НачалоПериода, КонецПериода);
		ИначеЕсли ТипОтчета = "InventoryTurnover" Тогда
			СтрокаДляОтвета = СформироватьОтчетПоЗапасамОбороты(НачалоПериода, КонецПериода);
		ИначеЕсли ТипОтчета = "Goods" Тогда
			СтрокаДляОтвета = СформироватьОтчетПоПартиямТоваров(НачалоПериода, КонецПериода);
		ИначеЕсли ТипОтчета = "Sales" Тогда
			СтрокаДляОтвета = СформироватьОтчетПоПродажам(НачалоПериода, КонецПериода);
		Иначе
			МассивДоступныхТипов = Новый Массив;
			МассивДоступныхТипов.Добавить("Saldo");
			МассивДоступныхТипов.Добавить("PaymentTerms");
			МассивДоступныхТипов.Добавить("CounterpartiesSettlements");
			МассивДоступныхТипов.Добавить("SuppliersSettlements");
			МассивДоступныхТипов.Добавить("InventoryBalance");
			МассивДоступныхТипов.Добавить("InventoryTurnover");
			МассивДоступныхТипов.Добавить("Goods");
			МассивДоступныхТипов.Добавить("Sales");

			СтрокаДляОтвета = ОбработкаJSON.ЗаписатьJSON_Обработка(МассивДоступныхТипов);
		КонецЕсли;

	Исключение
		Возврат СформироватьОтветДляHTTPСервиса(404, ОписаниеОшибки());
	КонецПопытки;

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "text/csv;  charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	УстановитьПривилегированныйРежим(Ложь);

	Возврат ДобавитьЗаголовки(Ответ);
КонецФункции

Функция СоздатьЗаголовкиCSV(ТЗ, разделитель = ",")

	КолонкиТЗ = ТЗ.Колонки;
	стрКолонки = "";

	Для каждого Колонка Из КолонкиТЗ Цикл

		Если СтрДлина(стрКолонки) > 0 Тогда
			стрКолонки = стрКолонки + разделитель;
		КонецЕсли;    

		стрКолонки = стрКолонки + Колонка.Имя;

	КонецЦикла; 

	Возврат стрКолонки;

КонецФункции	

Функция СоздатьСтрокуCSV(записьТаблицаЗначений, разделитель)    

	стрЗапись = "";    

	Для каждого поле Из записьТаблицаЗначений Цикл

		Если СтрДлина(стрЗапись)>0 Тогда
			стрЗапись = стрЗапись + разделитель;
		КонецЕсли;    

		Если ТипЗнч(поле) = Тип("Число") Тогда
			стрПоле = ?(ЗначениеЗаполнено(поле),Формат(поле,"ЧРД=.; ЧГ=0"),"0");

		ИначеЕсли ТипЗнч(поле) = Тип("Дата") Тогда 
			стрПоле = Формат(поле,"ДФ=dd.MM.yyyy");

		Иначе //Если ТипЗнч(поле) = Тип("Строка") Тогда

			стрПоле = СтрЗаменить(Строка(поле),"""","""""");

			Если 
				(Найти(стрПоле," ")>0 ) ИЛИ (Найти(стрПоле,"""")>0) ИЛИ (Найти(стрПоле,",")>0 ) ИЛИ (Найти(стрПоле,";")>0 ) ИЛИ (Найти(стрПоле,Символы.Таб)>0)  ИЛИ (Найти(стрПоле,Символы.ВК)>0)   ИЛИ (Найти(стрПоле,Символы.ПФ)>0)   ИЛИ (Найти(стрПоле,Символы.ВТаб)>0) ИЛИ (Найти(стрПоле,Символы.НПП)>0)  ИЛИ (Найти(стрПоле,Символы.ПС)>0) 
			Тогда 
				стрПоле = """"+стрПоле+"""";
			КонецЕсли;    

		КонецЕсли;     

		стрЗапись = стрЗапись + Строка(стрПоле);

	КонецЦикла; 

	Возврат стрЗапись;

КонецФункции

Функция СоздатьДанныеCSV(таблицаЗначений, разделитель = ",", выводитьЗаголовок = ЛОЖЬ)

	текстЗапись="";

	Если выводитьЗаголовок Тогда
		текстЗапись=СоздатьЗаголовкиCSV(ТаблицаЗначений, разделитель);    
	КонецЕсли;

	Для Каждого запись Из таблицаЗначений Цикл

		стрЗапись = СоздатьСтрокуCSV(запись,разделитель);            
		Если СтрДлина(стрЗапись)>0 Тогда
			текстЗапись = текстЗапись +    Символы.ПС;
		КонецЕсли;    
		текстЗапись = текстЗапись + стрЗапись;

	КонецЦикла;        

	Возврат текстЗапись;

КонецФункции // СоздатьДанныеCSV()

Функция СформироватьОтчетПоСальдо(НачалоПериода, КонецПериода, Организация)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиИОбороты.Счет.Код КАК AccountCode,
	               |	ОстаткиИОбороты.Счет.Наименование КАК AccountName,
	               |	ОстаткиИОбороты.Валюта КАК Currency,
	               |	СУММА(ОстаткиИОбороты.СуммаНачальныйОстаток) КАК OpeningBalanceAmount,
	               |	СУММА(ОстаткиИОбороты.СуммаНачальныйОстатокДт) КАК OpeningBalanceDebitAmount,
	               |	СУММА(ОстаткиИОбороты.СуммаНачальныйОстатокКт) КАК OpeningBalanceCreditAmount,
	               |	СУММА(ОстаткиИОбороты.СуммаКонечныйОстаток) КАК ClosingBalanceAmount,
	               |	СУММА(ОстаткиИОбороты.СуммаКонечныйОстатокДт) КАК ClosingBalanceDebitAmount,
	               |	СУММА(ОстаткиИОбороты.СуммаКонечныйОстатокКт) КАК ClosingBalanceCreditAmount,
	               |	СУММА(ОстаткиИОбороты.СуммаОборот) КАК TurnoverAmount,
	               |	СУММА(ОстаткиИОбороты.СуммаОборотДт) КАК TurnoverDebitAmount,
	               |	СУММА(ОстаткиИОбороты.СуммаОборотКт) КАК TurnoverCreditAmount,
	               |	СУММА(ОстаткиИОбороты.ВалютнаяСуммаНачальныйОстаток) КАК OpeningBalanceAmountCurrency,
	               |	СУММА(ОстаткиИОбороты.ВалютнаяСуммаНачальныйОстатокДт) КАК OpeningBalanceDebitAmountCurrency,
	               |	СУММА(ОстаткиИОбороты.ВалютнаяСуммаНачальныйОстатокКт) КАК OpeningBalanceCreditAmountCurrency,
	               |	СУММА(ОстаткиИОбороты.ВалютнаяСуммаКонечныйОстаток) КАК ClosingBalanceAmountCurrency,
	               |	СУММА(ОстаткиИОбороты.ВалютнаяСуммаКонечныйОстатокДт) КАК ClosingBalanceDebitAmountCurrency,
	               |	СУММА(ОстаткиИОбороты.ВалютнаяСуммаКонечныйОстатокКт) КАК ClosingBalanceCreditAmountCurrency,
	               |	СУММА(ОстаткиИОбороты.ВалютнаяСуммаОборот) КАК TurnoverAmountCurrency,
	               |	СУММА(ОстаткиИОбороты.ВалютнаяСуммаОборотДт) КАК TurnoverDebitAmountCurrency,
	               |	СУММА(ОстаткиИОбороты.ВалютнаяСуммаОборотКт) КАК TurnoverCreditAmountCurrency
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , , , Организация = &Организация) КАК ОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОстаткиИОбороты.Счет.Наименование,
	               |	ОстаткиИОбороты.Счет.Код,
	               |	ОстаткиИОбороты.Валюта";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Организация", Организация);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;

	ТЗ = РезультатЗапроса.Выгрузить();

	СтрCSV = СоздатьДанныеCSV(ТЗ, ";", Истина);
	Возврат СтрCSV;

КонецФункции

Функция СформироватьОтчетПоВзаиморасчетамСПоставщиками(НачалоПериода, КонецПериода)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Контрагент КАК Counterparty,
	               |	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Организация КАК Organization,
	               |	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка КАК Deal,
	               |	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК SettlementCurrency,
	               |	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток КАК EndingBalance
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, , ) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	               |ГДЕ
	               |	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Контрагент.Поставщик = ИСТИНА";	

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;

	ТЗ = РезультатЗапроса.Выгрузить();

	СтрCSV = СоздатьДанныеCSV(ТЗ, ";", Истина);
	Возврат СтрCSV;
КонецФункции

Функция СформироватьОтчетПоВзаиморасчетамСПокупателями(НачалоПериода, КонецПериода)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Контрагент КАК Counterparty,
	               |	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Организация КАК Organization,
	               |	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка КАК Deal,
	               |	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК SettlementCurrency,
	               |	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток КАК EndingBalance
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, , ) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	               |ГДЕ
	               |	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Контрагент.Покупатель = ИСТИНА";	

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;

	ТЗ = РезультатЗапроса.Выгрузить();

	СтрCSV = СоздатьДанныеCSV(ТЗ, ";", Истина);
	Возврат СтрCSV;
КонецФункции

Функция СформироватьОтчетПоЗапасамОстатки(НачалоПериода, КонецПериода)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад КАК OrganizationalUnit,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура КАК Item,
	               |	СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток) КАК EndingQuantity
				   //|	СУММА(ТоварыНаСкладахОстаткиИОбороты.СуммаКонечныйОстаток) КАК EndingAmount
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, , ) КАК ТоварыНаСкладахОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;

	ТЗ = РезультатЗапроса.Выгрузить();

	СтрCSV = СоздатьДанныеCSV(ТЗ, ";", Истина);
	Возврат СтрCSV;

КонецФункции

Функция СформироватьОтчетПоЗапасамОбороты(НачалоПериода, КонецПериода)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад КАК OrganizationalUnit,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура КАК Item,
	               |	СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоОборот) КАК TurnoverQuantity
				   //|	СУММА(ЗапасыОстаткиИОбороты.СуммаОборот) КАК TurnoverAmount
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, , ) КАК ТоварыНаСкладахОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;

	ТЗ = РезультатЗапроса.Выгрузить();

	СтрCSV = СоздатьДанныеCSV(ТЗ, ";", Истина);
	Возврат СтрCSV;

КонецФункции

Функция СформироватьОтчетПоСтруктуреДебиторскойЗадолжености(КонецПериода)

	ЗапросОтчет = Новый Запрос;
	ЗапросОтчет.Текст = "ВЫБРАТЬ
	                    |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Сделка,
	                    |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Организация,
	                    |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Контрагент,
	                    |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.ДоговорКонтрагента,
	                    |	МАКСИМУМ(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Период) КАК Период
	                    |ПОМЕСТИТЬ ВТ
	                    |ИЗ
	                    |	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Обороты(, &Период, Регистратор, ) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Сделка,
	                    |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Организация,
	                    |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Контрагент,
	                    |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.ДоговорКонтрагента
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток КАК Debt,
	                    |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент КАК Client,
	                    |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация КАК Organization,
	                    |	ДОБАВИТЬКДАТЕ(ВТ.Период, ДЕНЬ, ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности) КАК PaymentDue,
	                    |	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ВТ.Период, ДЕНЬ, ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности), &Период, ДЕНЬ) КАК DebtDays,
	                    |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Currency
	                    |ИЗ
	                    |	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&Период, ) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	                    |		ПО ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Сделка = ВТ.Сделка
	                    |			И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента = ВТ.ДоговорКонтрагента
	                    |			И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент = ВТ.Контрагент
	                    |			И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация = ВТ.Организация
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	Organization";

	ЗапросОтчет.УстановитьПараметр("Период", КонецДня(КонецПериода));

	РезультатЗапроса = ЗапросОтчет.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый HTTPСервисОтвет(404, "Дані відсутні");
	КонецЕсли;

	ТЗ = РезультатЗапроса.Выгрузить();

	СтрCSV = СоздатьДанныеCSV(ТЗ, ";", Истина);

	Возврат СтрCSV;

КонецФункции

Функция СформироватьОтчетПоПартиямТоваров(НачалоПериода, КонецПериода)

	ЗапросОтчет = Новый Запрос;
	ЗапросОтчет.Текст = "ВЫБРАТЬ
	                    |	ПартииТоваровНаСкладахОстаткиИОбороты.Склад КАК OrganizationalUnit,
	                    |	ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура КАК Item,
	                    |	ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток КАК OpeningQuantity,
	                    |	ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток КАК ClosingQuantity,
	                    |	ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоОборот КАК QuantityTurnover,
	                    |	ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоПриход КАК QuantityIn,
	                    |	ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоРасход КАК QuantityOut,
	                    |	ПартииТоваровНаСкладахОстаткиИОбороты.СтоимостьНачальныйОстаток КАК OpeningAmount,
	                    |	ПартииТоваровНаСкладахОстаткиИОбороты.СтоимостьКонечныйОстаток КАК ClosingAmount,
	                    |	ПартииТоваровНаСкладахОстаткиИОбороты.СтоимостьОборот КАК AmountTurnover,
	                    |	ПартииТоваровНаСкладахОстаткиИОбороты.СтоимостьПриход КАК AmountIn,
	                    |	ПартииТоваровНаСкладахОстаткиИОбороты.СтоимостьРасход КАК AmountOut
	                    |ИЗ
	                    |	РегистрНакопления.ПартииТоваровНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ПартииТоваровНаСкладахОстаткиИОбороты";

	ЗапросОтчет.УстановитьПараметр("НачалоПериода", НачалоМесяца(НачалоПериода));
	ЗапросОтчет.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));

	РезультатЗапроса = ЗапросОтчет.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый HTTPСервисОтвет(404, "Дані відсутні");
	КонецЕсли;

	ТЗ = РезультатЗапроса.Выгрузить();

	СтрCSV = СоздатьДанныеCSV(ТЗ, ";", Истина);

	Возврат СтрCSV;

КонецФункции

Функция СформироватьОтчетПоПродажам(НачалоПериода, КонецПериода)

	ЗапросОтчет = Новый Запрос;

	ЗапросОтчет.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	ВложенныйЗапрос.Организация КАК Organization,
	                    |	ВложенныйЗапрос.Подразделение КАК Department,
	                    |	ВложенныйЗапрос.Покупатель КАК Client,
	                    |	ВложенныйЗапрос.Номенклатура КАК Item,
	                    |	ВложенныйЗапрос.ЗаказПокупателя КАК CustomerOrder,
	                    |	ВложенныйЗапрос.Количество КАК Quantity,
	                    |	ВложенныйЗапрос.Стоимость КАК Amount,
	                    |	ВложенныйЗапрос.СтоимостьНДС КАК VATAmount,
	                    |	ВложенныйЗапрос.СтоимостьСНДС КАК AmountVAT,
	                    |	ВложенныйЗапрос.Себестоимость КАК Cost,
	                    |	ВложенныйЗапрос.СебестоимостьСНДС КАК CostVAT,
	                    |	ВложенныйЗапрос.ВаловаяПрибыль КАК NetProfit,
	                    |	ВложенныйЗапрос.ВаловаяПрибыльСНДС КАК GrossProfit
	                    |ИЗ
	                    |	(ВЫБРАТЬ
	                    |		ВложенныйЗапрос.Организация КАК Организация,
	                    |		ВложенныйЗапрос.Проект КАК Проект,
	                    |		ВложенныйЗапрос.Подразделение КАК Подразделение,
	                    |		ВложенныйЗапрос.Покупатель КАК Покупатель,
	                    |		ВложенныйЗапрос.ДоговорПокупателя КАК ДоговорПокупателя,
	                    |		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	                    |		ВложенныйЗапрос.ЗаказПокупателя КАК ЗаказПокупателя,
	                    |		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	                    |		СУММА(ВложенныйЗапрос.Стоимость) КАК Стоимость,
	                    |		СУММА(ВложенныйЗапрос.СтоимостьНДС) КАК СтоимостьНДС,
	                    |		СУММА(ВложенныйЗапрос.СтоимостьСНДС) КАК СтоимостьСНДС,
	                    |		СУММА(ВложенныйЗапрос.Себестоимость) КАК Себестоимость,
	                    |		СУММА(ВложенныйЗапрос.СебестоимостьНДС) КАК СебестоимостьНДС,
	                    |		СУММА(ВложенныйЗапрос.СебестоимостьСНДС) КАК СебестоимостьСНДС,
	                    |		СУММА(ВложенныйЗапрос.Стоимость) - СУММА(ВложенныйЗапрос.Себестоимость) КАК ВаловаяПрибыль,
	                    |		СУММА(ВложенныйЗапрос.СтоимостьСНДС) - СУММА(ВложенныйЗапрос.СебестоимостьСНДС) КАК ВаловаяПрибыльСНДС
	                    |	ИЗ
	                    |		(ВЫБРАТЬ
	                    |			ПродажиОбороты.Проект КАК Проект,
	                    |			ПродажиОбороты.Подразделение КАК Подразделение,
	                    |			ПродажиОбороты.Контрагент КАК Покупатель,
	                    |			ПродажиОбороты.ДоговорКонтрагента КАК ДоговорПокупателя,
	                    |			ПродажиОбороты.Номенклатура КАК Номенклатура,
	                    |			ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                    |			ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	                    |			ПродажиОбороты.Организация КАК Организация,
	                    |			ПродажиОбороты.Регистратор КАК Регистратор,
	                    |			ПродажиОбороты.Период КАК Период,
	                    |			ПродажиОбороты.КоличествоОборот КАК Количество,
	                    |			ПродажиОбороты.КоличествоОборот * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) / ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК КоличествоЕдиницОтчетов,
	                    |			ПродажиОбороты.КоличествоОборот * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) КАК КоличествоБазовыхЕдиниц,
	                    |			ПродажиОбороты.СтоимостьОборот КАК Стоимость,
	                    |			ПродажиОбороты.НДСОборот КАК СтоимостьНДС,
	                    |			ПродажиОбороты.СтоимостьОборот + ПродажиОбороты.НДСОборот КАК СтоимостьСНДС,
	                    |			ЕСТЬNULL(ТаблицаРегистраПродажиСебестоимость.СтоимостьОборот, 0) КАК Себестоимость,
	                    |			ЕСТЬNULL(ТаблицаРегистраПродажиСебестоимость.НДСОборот, 0) КАК СебестоимостьНДС,
	                    |			ЕСТЬNULL(ТаблицаРегистраПродажиСебестоимость.СтоимостьОборот + ТаблицаРегистраПродажиСебестоимость.НДСОборот, 0) КАК СебестоимостьСНДС
	                    |		ИЗ
	                    |			РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Регистратор, {(Организация).* КАК Организация, (Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Контрагент).* КАК Покупатель, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры, (ЗаказПокупателя).* КАК ЗаказПокупателя}) КАК ПродажиОбороты
	                    |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                    |					ПродажиСебестоимость.Номенклатура КАК Номенклатура,
	                    |					ПродажиСебестоимость.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                    |					ПродажиСебестоимость.ЗаказПокупателя КАК ЗаказПокупателя,
	                    |					ВЫБОР
	                    |						КОГДА ПродажиСебестоимость.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	                    |							ТОГДА ПродажиСебестоимость.ДокументДвижения
	                    |						ИНАЧЕ ПродажиСебестоимость.Регистратор
	                    |					КОНЕЦ КАК Регистратор,
	                    |					СУММА(ПродажиСебестоимость.Стоимость) КАК СтоимостьОборот,
	                    |					СУММА(ПродажиСебестоимость.НДС) КАК НДСОборот
	                    |				ИЗ
	                    |					РегистрНакопления.ПродажиСебестоимость КАК ПродажиСебестоимость
	                    |				ГДЕ
	                    |					ПродажиСебестоимость.Период МЕЖДУ &НачалоПериода И &КонецПериода
	                    |				{ГДЕ
	                    |					ПродажиСебестоимость.Проект.* КАК Проект,
	                    |					ПродажиСебестоимость.Подразделение.* КАК Подразделение,
	                    |					ПродажиСебестоимость.Номенклатура.* КАК Номенклатура,
	                    |					ПродажиСебестоимость.ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
	                    |					ПродажиСебестоимость.ЗаказПокупателя.* КАК ЗаказПокупателя}
	                    |				
	                    |				СГРУППИРОВАТЬ ПО
	                    |					ПродажиСебестоимость.Номенклатура,
	                    |					ПродажиСебестоимость.ХарактеристикаНоменклатуры,
	                    |					ПродажиСебестоимость.ЗаказПокупателя,
	                    |					ВЫБОР
	                    |						КОГДА ПродажиСебестоимость.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	                    |							ТОГДА ПродажиСебестоимость.ДокументДвижения
	                    |						ИНАЧЕ ПродажиСебестоимость.Регистратор
	                    |					КОНЕЦ) КАК ТаблицаРегистраПродажиСебестоимость
	                    |				ПО (ТаблицаРегистраПродажиСебестоимость.Номенклатура = ПродажиОбороты.Номенклатура)
	                    |					И (ТаблицаРегистраПродажиСебестоимость.ХарактеристикаНоменклатуры = ПродажиОбороты.ХарактеристикаНоменклатуры)
	                    |					И (ТаблицаРегистраПродажиСебестоимость.ЗаказПокупателя = ПродажиОбороты.ЗаказПокупателя)
	                    |					И (ТаблицаРегистраПродажиСебестоимость.Регистратор = ПродажиОбороты.Регистратор)) КАК ВложенныйЗапрос
	                    |	
	                    |	СГРУППИРОВАТЬ ПО
	                    |		ВложенныйЗапрос.Организация,
	                    |		ВложенныйЗапрос.Проект,
	                    |		ВложенныйЗапрос.Подразделение,
	                    |		ВложенныйЗапрос.Покупатель,
	                    |		ВложенныйЗапрос.ДоговорПокупателя,
	                    |		ВложенныйЗапрос.Номенклатура,
	                    |		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	                    |		ВложенныйЗапрос.ЗаказПокупателя,
	                    |		ВложенныйЗапрос.Регистратор,
	                    |		ВложенныйЗапрос.Период
	                    |	
	                    |	ИМЕЮЩИЕ
	                    |		(СУММА(ВложенныйЗапрос.Количество) <> 0
	                    |			ИЛИ СУММА(ВложенныйЗапрос.Стоимость) <> 0
	                    |			ИЛИ СУММА(ЕСТЬNULL(ВложенныйЗапрос.Себестоимость, 0)) <> 0)) КАК ВложенныйЗапрос
	                    |{ГДЕ
	                    |	ВложенныйЗапрос.Количество,
	                    |	ВложенныйЗапрос.Стоимость,
	                    |	ВложенныйЗапрос.СтоимостьНДС,
	                    |	ВложенныйЗапрос.СтоимостьСНДС,
	                    |	ВложенныйЗапрос.Себестоимость,
	                    |	ВложенныйЗапрос.СебестоимостьНДС,
	                    |	ВложенныйЗапрос.СебестоимостьСНДС,
	                    |	ВложенныйЗапрос.ВаловаяПрибыль}
	                    |ИТОГИ
	                    |	СУММА(Quantity),
	                    |	СУММА(Amount),
	                    |	СУММА(VATAmount),
	                    |	СУММА(AmountVAT),
	                    |	СУММА(Cost),
	                    |	СУММА(CostVAT),
	                    |	СУММА(ВложенныйЗапрос.Стоимость) - СУММА(Себестоимость) КАК NetProfit
	                    |ПО
	                    |	ОБЩИЕ
	                    |{ИТОГИ ПО
	                    |	Организация.*,
	                    |	ВложенныйЗапрос.Проект.*,
	                    |	Подразделение.*,
	                    |	Покупатель.*,
	                    |	ВложенныйЗапрос.ДоговорПокупателя.*,
	                    |	ВложенныйЗапрос.Номенклатура.*,
	                    |	ЗаказПокупателя.*}
	                    |АВТОУПОРЯДОЧИВАНИЕ";
	ЗапросОтчет.УстановитьПараметр("НачалоПериода", НачалоМесяца(НачалоПериода));
	ЗапросОтчет.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));

	РезультатЗапроса = ЗапросОтчет.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый HTTPСервисОтвет(404, "Дані відсутні");
	КонецЕсли;

	ТЗ = РезультатЗапроса.Выгрузить();

	СтрCSV = СоздатьДанныеCSV(ТЗ, ";", Истина);

	Возврат СтрCSV;

КонецФункции

#КонецОбласти

Функция Options(Запрос)
	
	Результат = Новый HTTPСервисОтвет(200);
	Возврат ДобавитьЗаголовки(Результат);
	
КонецФункции

Функция ДокументыИзменитьДанные(Запрос)

	ТипДокумента = Запрос.ПараметрыЗапроса.Получить("type");

	УстановитьПривилегированныйРежим(Истина);
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;

	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
	Данные = ПрочитатьJSONИзСтроки(СтрокаJSON);
	
	ДанныеРезультат = Новый Структура("status, msg, id, number", "", "", "", "");

	Если ТипДокумента = "incoming_invoice_utp" Тогда 
		Документы_ИзменитьДанныеПриходнаяНакладная(Данные, Пользователь, ДанныеРезультат);
	ИначеЕсли ТипДокумента = "supplier_order_utp" Тогда 
		Документы_ИзменитьДанныеЗаказПоставщику(Данные, Пользователь, ДанныеРезультат);		
	КонецЕсли;
	
	СтрокаДляОтвета = ОбработкаJSON.ЗаписатьJSON_Обработка(ДанныеРезультат);
	
	Результат = Новый HTTPСервисОтвет(200);	
	Результат.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8");
	Результат.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДобавитьЗаголовки(Результат);
	
КонецФункции

Функция СправочникиПолучитьДанные(Запрос)
	
	ТипСправочника = Запрос.ПараметрыЗапроса.Получить("type");

	УстановитьПривилегированныйРежим(Истина);
	
	МассивДанные = Новый Массив;
	
	Если ТипСправочника = "organizations" Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	сСправочник.Ссылка КАК Ссылка,
		               |	сСправочник.Наименование КАК Наименование,
		               |	ЕСТЬNULL(КодыОрганизацииСрезПоследних.ИНН, """") КАК ИНН,
		               |	сСправочник.НаименованиеПолное
		               |ИЗ
		               |	Справочник.Организации КАК сСправочник
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыОрганизации.СрезПоследних КАК КодыОрганизацииСрезПоследних
		               |		ПО сСправочник.Ссылка = КодыОрганизацииСрезПоследних.Организация
		               |ГДЕ
		               |	сСправочник.ПометкаУдаления = ЛОЖЬ";
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДЗ = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДЗ.Следующий() Цикл	
			
			СтруктураДанные = Новый Структура;
			СтруктураДанные.Вставить("id", ВыборкаДЗ.Ссылка.УникальныйИдентификатор());
			СтруктураДанные.Вставить("name", ВыборкаДЗ.Наименование);
			СтруктураДанные.Вставить("fullName", ВыборкаДЗ.НаименованиеПолное);
			СтруктураДанные.Вставить("tin", ВыборкаДЗ.ИНН);
			МассивДанные.Добавить(СтруктураДанные);	
			
		КонецЦикла;
		
	ИначеЕсли ТипСправочника = "clients" Тогда
		
		МассивДанные = Справочники_ПолучитьДанныеКонтрагенты();
		
	ИначеЕсли ТипСправочника = "clients_hierarchy" Тогда
		
		МассивДанные = Справочники_ПолучитьДанныеКонтрагентыИерархия();		

	ИначеЕсли ТипСправочника = "nomenclature" Тогда
		
		МассивДанные = Справочники_ПолучитьДанныеНоменклатура();

	ИначеЕсли ТипСправочника = "nomenclature_hierarchy" Тогда
		
		МассивДанные = Справочники_ПолучитьДанныеНоменклатураИерархия();
		
	ИначеЕсли ТипСправочника = "warehouses" Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	сСправочник.Ссылка КАК Ссылка,
		               |	сСправочник.Наименование КАК Наименование
		               |ИЗ
		               |	Справочник.Склады КАК сСправочник
		               |ГДЕ
		               |	сСправочник.ПометкаУдаления = ЛОЖЬ
		               |	И НЕ сСправочник.ЭтоГруппа";
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДЗ = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДЗ.Следующий() Цикл	
			
			СтруктураДанные = Новый Структура;			
			СтруктураДанные.Вставить("id", ВыборкаДЗ.Ссылка.УникальныйИдентификатор());
			СтруктураДанные.Вставить("name", ВыборкаДЗ.Наименование);	
			
			МассивДанные.Добавить(СтруктураДанные);	
			
		КонецЦикла;	

	ИначеЕсли ТипСправочника = "ratesVAT" Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	сСправочник.Ссылка КАК Наименование,
		               |	сСправочник.Порядок
		               |ИЗ
		               |	Перечисление.СтавкиНДС КАК сСправочник";
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДЗ = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДЗ.Следующий() Цикл
			
			СтруктураДанные = Новый Структура;
			знПеречисления = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления.Получить(ВыборкаДЗ.Порядок);
			Если знПеречисления <> Неопределено Тогда
				СтруктураДанные.Вставить("id", знПеречисления.Имя);
			Иначе
				СтруктураДанные.Вставить("id", "");
			КонецЕсли;			
			СтруктураДанные.Вставить("name", знПеречисления.Представление());
			
			МассивДанные.Добавить(СтруктураДанные);
			
		КонецЦикла;
		
	ИначеЕсли ТипСправочника = "units" Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	сСправочник.Ссылка КАК Ссылка,
		               |	сСправочник.Наименование КАК Наименование
		               |ИЗ
		               |	Справочник.КлассификаторЕдиницИзмерения КАК сСправочник
		               |ГДЕ
		               |	сСправочник.ПометкаУдаления = ЛОЖЬ";
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДЗ = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДЗ.Следующий() Цикл
			
			СтруктураДанные = Новый Структура;
			СтруктураДанные.Вставить("id", ВыборкаДЗ.Ссылка.УникальныйИдентификатор());
			СтруктураДанные.Вставить("name", ВыборкаДЗ.Наименование);
						
			МассивДанные.Добавить(СтруктураДанные);
			
		КонецЦикла;	
	
	ИначеЕсли ТипСправочника = "currencies" Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	сСправочник.Ссылка КАК Ссылка,
		               |	сСправочник.Наименование КАК Наименование
		               |ИЗ
		               |	Справочник.Валюты КАК сСправочник
		               |ГДЕ
		               |	сСправочник.ПометкаУдаления = ЛОЖЬ";
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДЗ = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДЗ.Следующий() Цикл
			
			СтруктураДанные = Новый Структура;
			СтруктураДанные.Вставить("id", ВыборкаДЗ.Ссылка.УникальныйИдентификатор());
			СтруктураДанные.Вставить("name", ВыборкаДЗ.Наименование);
						
			МассивДанные.Добавить(СтруктураДанные);
			
		КонецЦикла;	
		
	ИначеЕсли ТипСправочника = "currencyRates" Тогда
		
		ВалютаУИД = Запрос.ПараметрыЗапроса.Получить("currency");	
		стрДата = Запрос.ПараметрыЗапроса.Получить("date");	
		
	    Валюта = Справочники.Валюты.ПолучитьСсылку(Новый УникальныйИдентификатор(ВалютаУИД));
	    Дата = Дата(стрДата);
		
		ВалютаКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата - 86400, Новый Структура("Валюта", Валюта));
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("id", Валюта.УникальныйИдентификатор());
		СтруктураДанные.Вставить("name", Валюта.Наименование);
		СтруктураДанные.Вставить("rate", ВалютаКурсКратность.Курс);
		СтруктураДанные.Вставить("multiplicity", ВалютаКурсКратность.Кратность);
		
		МассивДанные.Добавить(СтруктураДанные);
			
	Иначе		
		Возврат СформироватьОтветДляHTTPСервиса(404, "Не найден тип справочника!");
	КонецЕсли;	
		
	ДанныеОтвет = Новый Структура(ТипСправочника, МассивДанные);	
	СтрокаДляОтвета = ОбработкаJSON.ЗаписатьJSON_Обработка(ДанныеОтвет);
	
	Результат = Новый HTTPСервисОтвет(200);	
	Результат.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8");
	Результат.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДобавитьЗаголовки(Результат);

КонецФункции

Функция СправочникиИзменитьДанные(Запрос)
	
	ТипСправочника = Запрос.ПараметрыЗапроса.Получить("type");

	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
	Данные = ПрочитатьJSONИзСтроки(СтрокаJSON);
	ДанныеРезультат = Новый Структура;
		
	Если ТипСправочника = "nomenclature" Тогда
		
		Если Данные.Свойство("id") И ЗначениеЗаполнено(Данные.id) Тогда
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.id));
			НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
			Если НоменклатураОбъект = Неопределено Тогда
				Возврат СформироватьОтветДляHTTPСервиса(404, "Номенклатуру не найдено!");
			КонецЕсли;	
		Иначе
			НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		КонецЕсли;	
		
		НоменклатураОбъект.Заполнить(Неопределено);
		НоменклатураОбъект.Наименование = Данные.name;
		НоменклатураОбъект.НаименованиеПолное = Данные.name;
		НоменклатураОбъект.Артикул = Данные.article;
		
		знПеречисления = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления.Найти(Данные.rate_VAT_id);
		Если знПеречисления <> Неопределено Тогда
			НоменклатураОбъект.СтавкаНДС = Перечисления.СтавкиНДС[знПеречисления.Имя];
		КонецЕсли;	
		
		Если Данные.Свойство("unit") И ЗначениеЗаполнено(Данные.unit) Тогда
			НоменклатураОбъект.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.unit));		
		КонецЕсли;
		
		знПеречисления = Метаданные.Перечисления.ТипыНоменклатуры.ЗначенияПеречисления.Найти(Данные.type);
		Если знПеречисления <> Неопределено Тогда
			НоменклатураОбъект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоРеквизиту("ТипНоменклатуры", Перечисления.ТипыНоменклатуры[знПеречисления.Имя]);
		Иначе
			НоменклатураОбъект.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоРеквизиту("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар);	
		КонецЕсли;
					
		Попытка
			НоменклатураОбъект.Записать();
		Исключение
			Возврат СформироватьОтветДляHTTPСервиса(500, "Ошибка записи номенклатуры!");
		КонецПопытки;
		
		Номенклатура = НоменклатураОбъект.Ссылка;
		
		МассивРезультат = Справочники_ПолучитьДанныеНоменклатура(Номенклатура);
		Если МассивРезультат.Количество() Тогда
			ДанныеРезультат = МассивРезультат[0];
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокаДляОтвета = ОбработкаJSON.ЗаписатьJSON_Обработка(ДанныеРезультат);
	
	Результат = Новый HTTPСервисОтвет(200);	
	Результат.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8");
	Результат.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДобавитьЗаголовки(Результат);
	
КонецФункции

Функция head(Запрос)
	Результат = Новый HTTPСервисОтвет(200);
	Возврат ДобавитьЗаголовки(Результат);
КонецФункции

